//
//  TermsOfSeviceViewController.swift
//  GetCoupon
//
//  Created by Nikita Konashenko on 15.04.2020.
//  Copyright © 2020 Nikita Konashenko. All rights reserved.
//

import UIKit

class TermsOfSeviceViewController: UIViewController {
  
  @IBOutlet weak var textView: UITextView!
  @IBOutlet weak var activityIndicator: UIActivityIndicatorView!
  
  override func viewDidLoad() {
    super.viewDidLoad()
     
    textView.textContainerInset = UIEdgeInsets(top: 10, left: 10, bottom: 40, right: 10)
  }
  
  override func viewDidAppear(_ animated: Bool) {
    super.viewDidAppear(animated)
    if textView.text.isEmpty {
      activityIndicator.stopAnimating()
      textView.text = termsOfServiceText
    }
  }
  
  var termsOfServiceText = """
  1. Общие положения

  1.1. Конашенко Никита Сергеевич (далее — «GetCoupon») предлагает пользователю сети Интернет (далее — «Пользователь») — использовать сервис «GetCoupon» (далее — «Сервис») на условиях, изложенных в настоящем пользовательском соглашении (далее — «Соглашение», «ПС»). Соглашение вступает в силу с момента выражения Пользователем согласия с его условиями в порядке, предусмотренном п. 1.6 Соглашения.

  Сервис доступен на сайте в мобильном приложении «GetCoupon» для iOS (далее — «Приложение»).

  1.2. В рамках сервиса GetCoupon предлагает Пользователям:
  1.2.1. доступ к справочной информации об ассортименте, ценах, скидках, акциях и иной информации о товарах в магазинах (далее — «Данные», а в совокупности — «База Данных»);
  1.2.2. функцию по формированию списка избранных магазинов;
  1.2.3. иные функции, предусмотренные функциональными возможностями Сервиса.

  1.3. Вся существующая в настоящий момент функциональность Сервиса, а также любое развитие и/или добавление новых функций является предметом настоящего Соглашения и дополнений к нему.

  1.4. Использование Сервиса Пользователем на условиях настоящего Соглашения осуществляется в личных некоммерческих целях. Для использования Сервиса иными способами и для других целей Пользователю необходимо предварительно получить письменное согласие от GetCoupon на такое использование.

  1.5. Соглашение может быть изменено GetCoupon без какого-либо специального уведомления, новая редакция Соглашения вступает в силу с момента ее размещения в сети Интернет по указанному в настоящем абзаце адресу, если иное не предусмотрено новой редакцией Соглашения.

  1.6. Начиная использовать Сервис/его отдельные функции, Пользователь считается принявшим условия Соглашения в полном объеме, без всяких оговорок и исключений. В случае несогласия Пользователя с какими-либо из положений Соглашения, Пользователь не вправе использовать Сервис/его отдельные функции. В случае если GetCoupon были внесены какие-либо изменения в Соглашение в порядке, предусмотренном пунктом 1.5 Соглашения, с которыми Пользователь не согласен, он обязан прекратить использование Сервиса.


  2. Право на использование Сервиса, Данных/Базы данных

  2.1. Правообладателями (в том числе на основании лицензии) на все объекты, доступные при помощи Сервиса, в том числе элементы дизайна, графические изображения, иллюстрации, программы для ЭВМ, Данные, Базы данных и другие объекты (далее — «Содержание Сервиса») являются GetCoupon и иные правообладатели.

  2.2. Использование Содержания Сервиса, а также иного контента и иных элементов сервисов возможно только в рамках функционала, предлагаемого Сервисом.

  Никакие элементы Содержания Сервиса, а также любой контент, размещенный на Сервисе, не могут быть использованы иным образом. Под использованием подразумеваются, в том числе: воспроизведение, копирование, переработка, распространение на любой основе, отображение во фрейме и т. д. Исключение составляют случаи, прямо предусмотренные законодательством РФ.

  2.3. Пользователь не имеет права распространять Содержание Сервиса в виде, отличном от того, в котором он его получил, без письменного согласия GetCoupon.

  2.4. Любое извлечение, копирование, воспроизведение, переработка Данных, Базы данных, Содержания Сервиса, распространение, доведение до всеобщего сведения в сети Интернет, любое использование в программах и сервисах третьих лиц, средствах массовой информации и/или в коммерческих целях без предварительного письменного разрешения GetCoupon или иного правообладателя запрещается.

  3. Условия использования отдельных функций Сервиса

  3.1. Выполнение функций Сервиса возможно только при наличии доступа к сети Интернет. Пользователь самостоятельно получает и оплачивает такой доступ на условиях и по тарифам своего оператора связи или провайдера доступа к сети Интернет.

  3.2. GetCoupon оставляет за собой право на свое усмотрение ограничить доступ Пользователя к Сервису (или к определенному Содержанию Сервиса или функциям Сервиса, если это возможно технологически) при нарушении условий Соглашения, либо применить к Пользователю иные меры с целью соблюдения требований законодательства или прав и законных интересов третьих лиц.

  3.3. GetCoupon несет ответственность за рекламу, размещенную им на Сервисе, в пределах, установленным законодательством о рекламе.

  3.4. При использовании Сервиса для получения информации о скидках, Пользователь уведомлен о том, что Данные предоставляются их обладателями, партнерами GetCoupon или получаются из общедоступных источников. GetCoupon не обязуется осуществлять проверку их точности и достоверности, не несет ответственности за их актуальность и соответствие действительности. Данные, предоставляемые в Сервисе, носят справочный характер и не являются публичной офертой GetCoupon.

  3.5. Среди источников данных могут быть Telegram-каналы «LowCoster», «Халява!!!», «ХаК – Халява акции купоны», «О, халява!», «Wow Sale», «Халява, приди!», «WSCOUPON - промокоды, купоны, скидки, акции на каждый день!», «BrainyMama - акции, промокоды, скидки» и другие открытые источники информации.


  4. Ограничение ответственности GetCoupon

  4.1. Сервис предоставляется на условиях «как есть» (as is). GetCoupon не предоставляет никаких гарантий в отношении безошибочной и бесперебойной работы Сервиса или отдельных его компонентов и/или функций, соответствия Сервиса и Данных конкретным целям и ожиданиям Пользователя, не гарантирует достоверность, точность, полноту и своевременность Данных, а также не предоставляет никаких иных гарантий, прямо не указанных в Соглашении.

  4.2. GetCoupon не несет ответственности за какие-либо прямые или косвенные последствия какого-либо использования или невозможности использования Сервиса и Данных и/или ущерб, причиненный Пользователю и/или третьим сторонам в результате какого-либо использования, неиспользования или невозможности использования Сервиса и Данных или отдельных его компонентов и/или функций, в том числе из-за возможных ошибок или сбоев в работе программно-аппаратных средств, за исключением случаев, прямо предусмотренных законодательством и соглашениями GetCoupon с Пользователями.

  4.3. Все вопросы и претензии, связанные с использованием/невозможностью использования Сервиса, недостоверностью Данных, а также возможным нарушением Сервисом или Данными законодательства и/или прав третьих лиц направляются через форму обратной связи в пункте «Настройки» Приложения, при необходимости с указанием контактных данных для обратной связи.


  5. Информационные сообщения

  5.1. Пользователь путем акцепта Соглашения дает свое согласие на получение информационных рассылок от GetCoupon, рассылок с последними новостями, акциями, новыми предложениями посредством push-уведомлений в Приложении.

  5.2. Пользователь может отказаться от push-уведомлений в Приложении путем изменения настроек используемого браузера и\\или мобильного телефона.


  6. Сайты третьих лиц

  6.1. Сервис может содержать ссылки на другие сайты в сети Интернет (сайты третьих лиц). Указанные третьи лица и их контент не проверяются GetCoupon на соответствие тем или иным требованиям (достоверности, полноты, законности и т. п.). GetCoupon не несет ответственность за любую информацию, материалы, размещенные на сайтах третьих лиц, к которым Пользователь получает доступ с использованием сервисов, в том числе, за любые мнения или утверждения, выраженные на сайтах третьих лиц, рекламу и т. п., а также за доступность таких сайтов или контента и последствия их использования Пользователем.

  6.2. Ссылка (в любой форме) на любой сайт, продукт, услугу, любую информацию коммерческого или некоммерческого характера, размещенная на Сервисе, не является одобрением или рекомендацией данных продуктов (услуг, деятельности) со стороны GetCoupon, за исключением случаев, когда на это прямо указывается на ресурсе.


  7. Заключительные положения

  7.1. К Соглашению и всем отношениям, связанным с использованием Сервиса, подлежит применению право Российской Федерации и любые претензии или иски, вытекающие из Соглашения и/или использования Сервиса должны быть поданы и рассмотрены в суде по месту нахождения GetCoupon.

  7.2. Использование Сервиса регулируется Соглашением.

  7.3. Если по тем или иным причинам одно или несколько положений Соглашения будут признаны недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных положений Соглашения.

  7.4. Соглашение представляет собой договор между Пользователем и GetCoupon относительно порядка использования Сервиса и заменяет собой все предыдущие соглашения между Пользователем и GetCoupon.

  7.5. В отношении услуг, оказываемых в рамках Соглашения на безвозмездной основе, нормы законодательства о защите прав потребителей, предусмотренные законодательством Российской Федерации, не могут быть применимыми к отношениям между Пользователем и GetCoupon.


  Опубликовано 28 июня 2020 г.
  """
  
  /*
   // MARK: - Navigation
   
   // In a storyboard-based application, you will often want to do a little preparation before navigation
   override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
   // Get the new view controller using segue.destination.
   // Pass the selected object to the new view controller.
   }
   */
  
}
