Repository: Kn1kt/GetCoupon
Catalog: Locale/*.lproj/Localizable.strings
Languages: ru, uk

# default-status
source: Home
ru: Главное
uk: Домашня

# updating-status
source: Updating...
ru: Обновление...
uk: Оновлення...

# updated-status
source: Successfully Updated
ru: Успешно обновлено
uk: Успішно оновлено

# error-status
source: Udpate Error
ru: Ошибка обновления
uk: Помилка оновлення

# waiting-for-nework-status
source: Waiting for Network...
ru: Ожидание соединения...
uk: Очікування з’єднання...

source: See All
ru: См. все
uk: Усе

source: Favorites
ru: Избранное
uk: Обране

# sort-by-dates
source: Sorted by Dates
ru: По дате добавления
uk: Сортуємо по датах

# search-bar-placeholder
source: Shops, Categories, Tags and More
ru: Магазины, категории, теги и др.
uk: Магазини, категорії, теги та ін.

source: Settings
ru: Настройки
uk: Налаштування

# basic-settings
source: Basic
ru: Основные
uk: Основні

# additional-settings
source: Additional
ru: Дополнительные
uk: Додатково

# push-notifications-title
source: Push Notifications
ru: Push-уведомления
uk: Push-повідомлення

# push-notifications-subtitle
source: Receive push notifications of new promo codes
ru: Получать push-уведомления о новых промокодах в любимых магазинах
uk: Отримувати push-повідомлення про нові промокоди в любимых магазинах

# clear-cache-title
source: Clear Cache
ru: Очистить кэш
uk: Очистити кеш

# share-promocode-title
source: Share Your Promo Code
ru: Поделиться своим промокодом
uk: Поділитися своїм промокодом

# share-promocode-subtitle
source: Found a new promo code? Send us and we will add it
ru: Нашли новый промокод? Отправьте нам, и мы добавим его
uk: Знайшли новий промокод? Надішліть нам, і ми додамо його

# share-promocode-screen-bar
source: Share
ru: Поделиться
uk: Поділитися

# share-promocode-screen-title
source: Share Your Coupon
ru: Поделитесь своим промокодом
uk: Поділіться своїм промокодом

# share-promocode-screen-subtitle
source: Send us a link to the site where you found the coupon.
ru: Отправьте нам ссылку на сайт, где вы нашли купон.
uk: Надішліть нам посилання на сайт, де Ви знайшли купон.

# rate-us-title
source: Rate Us
ru: Оценить нас
uk: Оцініть нас

# terms-of-service-title
source: Terms of Service
ru: Условия использования
uk: Умови використання

# give-feedback-title
source: Give Feedback
ru: Оставить отзыв
uk: Залишити відгук

# general-feedback-bar
source: Feedback
ru: Обратная связь
uk: Зворотний зв'язок

# general-feedback-title
source: General Feedback
ru: Общий отзыв
uk: Загальний відгук

# general-feedback-subtitle
source: Briefly explain what you love, or what could improve.
ru: Кратко объясните, что вы любите, или что можно улучшить.
uk: Коротко поясніть, що вам сподобалося, а що можна поліпшити.

# contact-us-title
source: For Commercial Use
ru: По вопросам сотрудничества
uk: З питань співробітництва

# notifications-alert-title
source: No Access to Notifications
ru: Нет доступа к уведомлениям
uk: Немає доступу до повідомлень

# notifications-alert-subtitle
source: Please, allow notifications for GetCoupon app in settings.
ru: Пожалуйста, включите уведомления для приложения GetCoupon в настройках.
uk: Будь ласка, увімкніть повідомлення для додатку GetCoupon в Налаштуваннях.

# deleting-images-alert-title
source: Deleting Cached Images
ru: Удаление кэшированных изображений
uk: Видалення кешованих зображень

# deleting-images-alert-subtitle
source: All cached images will be deleted.
ru: Все кэшированные изображения будут удалены.
uk: Всі кешовані зображення будуть видалені.

# deleting-images-alert-done
source: Clear Cache
ru: Очистить кэш
uk: Очистити кеш

# what-new
source: What's New?
ru: Что нового?
uk: Що нового?

source: Coupons
ru: Купона
uk: Купона

source: Website
ru: Веб-сайт
uk: Веб-сайт

source: Share
ru: Поделиться
uk: Поділитися

source: PINNED
ru: ЗАКРЕПЛЕНО
uk: Закріплено

source: Posted
ru: Опубликовано
uk: Опубліковано

# expire
source: Expiration Date
ru: Дата окончания
uk: Дата завершення

source: d
ru: д
uk: д

# exprire-at
source: Expiration Date
ru: Дата окончания
uk: Дата завершення

# shop-website-alert-title
source: Shop Website
ru: Сайт Магазина
uk: Сайт магазину

# shop-website-alert-subtitle
source: This store’s website will open.
ru: Откроется сайт этого магазина.
uk: Відкриється сайт цього магазину.

source: Copied Successfully
ru: Успешно скопировано
uk: Успішно скопійовано

source: by Sections
ru: По категориям
uk: По категоріям

source: by Popularity
ru: По рейтингу
uk: По популярності

source: by Dates
ru: По дате
uk: По датам

source: Search
ru: Поиск
uk: Пошук

source: Shops
ru: Магазинов
uk: Магазини

source: Cancel
ru: Отмена
uk: Скасувати

source: Send
ru: Отправить
uk: Відправити

source: Open
ru: Открыть
uk: Відкрити

# onboardingFirstTitle
source: Current Promo Codes
ru: Актуальные промокоды
uk: Актуальні промокоди

# onboardingFirstSubtitle
source: We are also tired of notifications via email and messengers! That's why we have collected all the promo codes in one app so that you can find them whenever you want.
ru: Мы тоже устали от уведомлений по почте и в мессенджерах! Поэтому собрали в одном приложении все промокоды, чтобы ты мог найти их, когда тебе захочется.
uk: Ми теж втомилися від повідомлень поштою і в месенджерах! Тому зібрали в одному додатку всі промокоди, щоб ти міг знайти їх, коли тобі захочеться.

# onboardingSecondTitle
source: No Shares
ru: Только полезные акции
uk: Тільки корисні акції

# onboardingSecondSubtitle
source: We decided not to clog the application with stocks (it’s hard to miss them), collecting only promotional codes for you, because we all know that there is more discount on them.
ru: Мы тщательно отбираем для тебя новые промокоды, стараясь не засорять приложение ненужными акциями. Но некоторые пропускать точно не стоит!
uk: Ми ретельно відбираємо для тебе нові промокоди, намагаючись не засмічувати додаток непотрібними акціями. Але деякі пропускати вже точно не варто!

# onboardingThirdTitle
source: Add to Favorites
ru: Получай уведомления
uk: Отримуй повідомлення

# onboardingThirdSubtitle
source: Click on the heart and receive notifications of new promotional codes from your favorite stores.
ru: Жми сердечко и получай уведомления о новых промокодах и скидках в любимых магазинах!
uk: Тисни сердечко і отримуй повідомлення про нові промокоди і знижки в улюблених магазинах.

# onboardingFourthTitle
source: Let's Improve the Application Together
ru: Давай улучшать приложение вместе
uk: Давай покращувати додаток разом

# onboardingFourthSubtitle
source: If you liked the application or there is something missing in it, you can write to us and we will answer!
ru: Если тебе понравилось приложение или в нём чего-то не хватает, ты можешь написать нам и мы обязательно ответим!
uk: Якщо тобі сподобався додаток або в ньому чогось не вистачає, ти можеш написати нам і ми обов'язково відповімо!
